const roomCoordinates = {
    "مخرج 1": { 'x': 27.51, 'y': 90.34 },
    "مخرج 2": { 'x': 56.35, 'y': 47.79 },
    "مخرج 3": { 'x': 87.18, 'y': 57.57 },
    "مخرج 4": { 'x': 11.71, 'y': 51.32 },
    "مسرح الكلية": { 'x': 72.6, 'y': 92.15 },
    "حمام 1": { 'x': 56.69, 'y': 71.69 },
    "حمام 2": { 'x': 33.59, 'y': 90.03 },
    "حمام 3": { 'x': 17.35, 'y': 65.43 },
    "مصعد 1": { 'x': 85.59, 'y': 63.79 },
    "مصعد 2": { 'x': 14.7, 'y': 47.12 },
    "درج الدور الثاني 1": { 'x': 54.36, 'y': 62.75 },
    "درج الدور الثاني 2": { 'x': 88.55, 'y': 96.53 },
    "درج الدور الثاني 3": { 'x': 9.23, 'y': 95.92 },
    "درج الدور الثاني 4": { 'x': 46.73, 'y': 89.37 }
  };
  